uat_chat/DataProcessors/РабочийСтолПроектОКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>РабочийСтолПроектОКО</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

uat_chat/InformationRegisters/юкИсключаемыеОбъектыИзПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>юкИсключаемыеОбъектыИзПроектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>логЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсключаемыйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/DataProcessors/РабочийСтолПроектОКО/Forms/ФормаАдминистрирования/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	юкИсключаемыеОбъектыИзПроектов.ИсключаемыйОбъект КАК ИсключаемыйОбъект,
		|	юкИсключаемыеОбъектыИзПроектов.логЗаписи КАК логЗаписи,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(юкИсключаемыеОбъектыИзПроектов.ИсключаемыйОбъект) = ТИП(Справочник.уатТС)
		|			ТОГДА юкИсключаемыеОбъектыИзПроектов.ИсключаемыйОбъект.ГаражныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ГаражныйНомер
		|ИЗ
		|	РегистрСведений.юкИсключаемыеОбъектыИзПроектов КАК юкИсключаемыеОбъектыИзПроектов";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ИсключаемыйОбъект) = Тип("СправочникСсылка.уатТС") тогда
			нСтр = ИсключаемыеТС.Добавить()
		Иначе
			нСтр = ИсключаемыеПодразделения.Добавить()
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(нСтр,Выборка);
	КонецЦикла;
	
	//Организуем раскраску строк в таблицах гаража и ремонта в зависимости от цвета гаража
	РаскрасимТаблицуГаражей(); //ПОКА ЧЕГО-ТО НЕ РАСКРАШИВАЕТСЯ
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.Модифицированность = Истина Тогда
		ЗаписатьРегистрСведений();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсключаемыеТСИсключаемыйОбъектПриИзменении(Элемент)
	Стр = Элементы.ИсключаемыеТС.ТекущиеДанные;
	Если ЗначениеЗаполнено(Стр.ИсключаемыйОбъект) Тогда
		Стр.ГаражныйНомер = Стр.ИсключаемыйОбъект.ГаражныйНомер;
		ЭтаФорма.Модифицированность = Истина; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИсключаемыеПодразделенияИсключаемыйОбъектПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияСтрокиОбъектовИсключения(Элемент)
	ЭтаФорма.Модифицированность = Истина; 
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегистрСведений()
	//Запишем исключаемые объекты в регистр сведений
	
	//Для начала его обнулим
	РегистрыСведений.юкИсключаемыеОбъектыИзПроектов.СоздатьНаборЗаписей().Записать();
	
	//Затем пишем данные табличек
	Для Каждого ХХХ Из ИсключаемыеПодразделения Цикл
		Зап = РегистрыСведений.юкИсключаемыеОбъектыИзПроектов.СоздатьМенеджерЗаписи();
		Зап.ИсключаемыйОбъект = ХХХ.ИсключаемыйОбъект;
		Зап.логЗаписи = ПараметрыСеанса.ТекущийПользователь.Наименование + " - " + Строка(ТекущаяДата());
		Зап.Записать();
	КонецЦикла;	
	
	Для Каждого ХХХ Из ИсключаемыеТС Цикл
		Зап = РегистрыСведений.юкИсключаемыеОбъектыИзПроектов.СоздатьМенеджерЗаписи();
		Зап.ИсключаемыйОбъект = ХХХ.ИсключаемыйОбъект;
		Зап.логЗаписи = ПараметрыСеанса.ТекущийПользователь.Наименование + " - " + Строка(ТекущаяДата());
		Зап.Записать();
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	Если ЭтаФорма.Модифицированность = Истина Тогда
		ЗаписатьРегистрСведений();
	КонецЕсли;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьФайлДанныхБСМТСНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.СформироватьФайлДанных_АвтоГРАФ5();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьФайлДанныхБСМТС(Команда)
	КомандаСформироватьФайлДанныхБСМТСНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаскрасимТаблицуГаражей()
	Выборка = Справочники.уатГаражи.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЦветГаража = Выборка.ЦветГаража.Получить();
		Если ЦветГаража <> Неопределено тогда
			
			Оформление  = УсловноеОформление.Элементы.Добавить();
			Оформление.Использование = Истина;
			Поле1 = Оформление.Поля.Элементы.Добавить();
			Поле1.Поле = Новый ПолеКомпоновкиДанных("СправочникГаражиНаименование");
			Поле2 = Оформление.Поля.Элементы.Добавить();
			Поле2.Поле = Новый ПолеКомпоновкиДанных("СправочникГаражиНаименованиеГеозоны");
			Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СправочникГаражи.Наименование");
			Отбор.ПравоеЗначение = Выборка.Ссылка.Наименование; 
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование = Истина;
			Оформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветГаража);	
			
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
